print('Введите слово')
#Abrakadabra
S = input()
print(S[2]) #Выведите третий символ этой строки
print(S[-2])#Выведите предпоследний символ этой строки.
print(S[0:5]) #Выведите первые пять символов этой строки.
print(S[0:-2])#Выведите всю строку, кроме последних двух
print(S[::2])#Выведите все символы с четными индексами
print(S[1::2])#Выведите все символы с нечетными индексами, то
#есть начиная со второго символа строки
print(S[::-1])#Выведите все символы в обратном порядке.
print(S[::-2])#Выведите все символы строки через один в обратном
#порядке, начиная с последнего.
print(len(S))#Выведите длину данной строки.

