print('Введите строку')
S = input()
#Напишите программу, которая отсекает всю часть строки после первого слова.
print(S[:S.find(" ")])


