print('Введите строку')
S = input()
#Дана строка, состоящая из слов, разделенных пробелами.
#Определите, сколько в ней слов. Используйте для решения
#задачи метод count. Выведите длину данной строки.
print(S.count(" ")+1)


